iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS30336/targetInit/tms570LS30336_sfr.h
  uint8_t res2[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLL1_SLIP_FILTER_KEY:4;
      uint64_t reservedSpace0:4;
      uint64_t PLL1_SLIP_FILTER_COUNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKSLIP;

  uint8_t res3[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFC_INSTR_WEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFC_CTLREG;

  uint32_t DIEIDL_REG0;
  uint32_t DIEIDH_REG1;
  uint32_t DIEIDL_REG2;
  uint32_t DIEIDH_REG3;
};

#define SYS2 (*(volatile struct SYS2_tag *) 0xffffe100)

struct PCR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPROTSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPROTSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTSET1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPROTCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPROTCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMPROTCLR1;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0:4;
      uint64_t PCS1:4;
      uint64_t PCS2:4;
      uint64_t PCS3:4;
      uint64_t PCS4:4;
      uint64_t PCS5:4;
      uint64_t PCS6:4;
      uint64_t PCS7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS8:4;
      uint64_t PCS9:4;
      uint64_t PCS10:4;
      uint64_t PCS11:4;
      uint64_t PCS12:4;
      uint64_t PCS13:4;
      uint64_t PCS14:4;
      uint64_t PCS15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS16:4;
      uint64_t PCS17:4;
      uint64_t PCS18:4;
      uint64_t PCS19:4;
      uint64_t PCS20:4;
      uint64_t PCS21:4;
      uint64_t PCS22:4;
      uint64_t PCS23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS24:4;
      uint64_t PCS25:4;
      uint64_t PCS26:4;
      uint64_t PCS27:4;
      uint64_t PCS28:4;
      uint64_t PCS29:4;
      uint64_t PCS30:4;
      uint64_t PCS31:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTSET3;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0:4;
      uint64_t PCS1:4;
      uint64_t PCS2:4;
      uint64_t PCS3:4;
      uint64_t PCS4:4;
      uint64_t PCS5:4;
      uint64_t PCS6:4;
      uint64_t PCS7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS8:4;
      uint64_t PCS9:4;
      uint64_t PCS10:4;
      uint64_t PCS11:4;
      uint64_t PCS12:4;
      uint64_t PCS13:4;
      uint64_t PCS14:4;
      uint64_t PCS15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS16:4;
      uint64_t PCS17:4;
      uint64_t PCS18:4;
      uint64_t PCS19:4;
      uint64_t PCS20:4;
      uint64_t PCS21:4;
      uint64_t PCS22:4;
      uint64_t PCS23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS24:4;
      uint64_t PCS25:4;
      uint64_t PCS26:4;
      uint64_t PCS27:4;
      uint64_t PCS28:4;
      uint64_t PCS29:4;
      uint64_t PCS30:4;
      uint64_t PCS31:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPROTCLR3;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPWRDNSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSPWRDWNSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPWRDNSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSPWRDWNSET1;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPWRDNCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSPWRDWNCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCSPWRDNCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCSPWRDWNCLR1;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0:4;
      uint64_t PCS1:4;
      uint64_t PCS2:4;
      uint64_t PCS3:4;
      uint64_t PCS4:4;
      uint64_t PCS5:4;
      uint64_t PCS6:4;
      uint64_t PCS7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS8:4;
      uint64_t PCS9:4;
      uint64_t PCS10:4;
      uint64_t PCS11:4;
      uint64_t PCS12:4;
      uint64_t PCS13:4;
      uint64_t PCS14:4;
      uint64_t PCS15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNSET1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS16:4;
      uint64_t PCS17:4;
      uint64_t PCS18:4;
      uint64_t PCS19:4;
      uint64_t PCS20:4;
      uint64_t PCS21:4;
      uint64_t PCS22:4;
      uint64_t PCS23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNSET2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS24:4;
      uint64_t PCS25:4;
      uint64_t PCS26:4;
      uint64_t PCS27:4;
      uint64_t PCS28:4;
      uint64_t PCS29:4;
      uint64_t PCS30:4;
      uint64_t PCS31:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNSET3;

  uint8_t res6[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS0:4;
      uint64_t PCS1:4;
      uint64_t PCS2:4;
      uint64_t PCS3:4;
      uint64_t PCS4:4;
      uint64_t PCS5:4;
      uint64_t PCS6:4;
      uint64_t PCS7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS8:4;
      uint64_t PCS9:4;
      uint64_t PCS10:4;
      uint64_t PCS11:4;
      uint64_t PCS12:4;
      uint64_t PCS13:4;
      uint64_t PCS14:4;
      uint64_t PCS15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNCLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS16:4;
      uint64_t PCS17:4;
      uint64_t PCS18:4;
      uint64_t PCS19:4;
      uint64_t PCS20:4;
      uint64_t PCS21:4;
      uint64_t PCS22:4;
      uint64_t PCS23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNCLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS24:4;
      uint64_t PCS25:4;
      uint64_t PCS26:4;
      uint64_t PCS27:4;
      uint64_t PCS28:4;
      uint64_t PCS29:4;
      uint64_t PCS30:4;
      uint64_t PCS31:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSPWRDWNCLR3;

