iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS30336/targetInit/tms570LS30336_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCITD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBREAK:3;
      uint64_t reservedSpace0:5;
      uint64_t SDEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCOMPARE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD3:8;
      uint64_t RD2:8;
      uint64_t RD1:8;
      uint64_t RD0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINRD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD7:8;
      uint64_t RD6:8;
      uint64_t RD5:8;
      uint64_t RD4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINRD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX:8;
      uint64_t reservedSpace0:8;
      uint64_t RX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
      uint64_t ID_SlaveTask_BYTE:8;
      uint64_t Received_ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD3:8;
      uint64_t TD2:8;
      uint64_t TD1:8;
      uint64_t TD0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINTD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD7:8;
      uint64_t TD6:8;
      uint64_t TD5:8;
      uint64_t TD4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINTD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBR:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBRS;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPENA:1;
      uint64_t LPBENA:1;
      uint64_t reservedSpace0:6;
      uint64_t IODFTENA:4;
      uint64_t reservedSpace1:4;
      uint64_t TX:3;
      uint64_t PIN:2;
      uint64_t reservedSpace2:3;
      uint64_t BRKD:1;
      uint64_t PEN:1;
      uint64_t FEN:1;
      uint64_t reservedSpace3:1;
      uint64_t ISFE:1;
      uint64_t CEN:1;
      uint64_t PBEN:1;
      uint64_t BEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IODFTCTRL;

};

#define SCILIN_Serial_Communication_InterfaceLocal_Interconnect_Network_Module_SCILIN_0 (*(volatile struct SCILIN_Serial_Communication_InterfaceLocal_Interconnect_Network_Module_SCILIN_0_tag *) 0xfff7e400)

struct SCILIN_Serial_Communication_InterfaceLocal_Interconnect_Network_Module_SCILIN_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMM:1;
      uint64_t TIMING:1;
      uint64_t PARITY_0:1;
      uint64_t PARITY_1:1;
      uint64_t STOP_0:1;
      uint64_t CLOCK:1;
      uint64_t LIN:1;
      uint64_t SWnRST:1;
      uint64_t SLEEP:1;
      uint64_t ADAPT:1;
      uint64_t MBUF:1;
      uint64_t CTYPE:1;
      uint64_t HGEN:1;
      uint64_t STOP_1:1;
      uint64_t reservedSpace0:2;
      uint64_t LOOP:1;
      uint64_t CONT:1;
      uint64_t reservedSpace1:6;
      uint64_t RXENA:1;
      uint64_t TXENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWERDOWN:1;
      uint64_t reservedSpace0:7;
      uint64_t GEN:1;
      uint64_t reservedSpace1:7;
      uint64_t SC:1;
      uint64_t CC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIGCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_0:1;
      uint64_t SET_1:1;
      uint64_t reservedSpace0:2;
      uint64_t SET_2:1;
      uint64_t reservedSpace1:1;
      uint64_t SET_3:1;
      uint64_t SET_4:1;
      uint64_t SET_5:1;
      uint64_t SET_6:1;
      uint64_t reservedSpace2:3;
      uint64_t SET_7:1;
      uint64_t reservedSpace3:2;
      uint64_t SET_8:1;
      uint64_t SET_9:1;
      uint64_t SET_10:1;
      uint64_t reservedSpace4:5;
      uint64_t SET_11:1;
      uint64_t SET_12:1;
      uint64_t SET_13:1;
      uint64_t SET_14:1;
      uint64_t SET_15:1;
      uint64_t SET_16:1;
      uint64_t SET_17:1;
      uint64_t SET_18:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCISETINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_0:1;
      uint64_t CLR_1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_2:1;
      uint64_t reservedSpace1:1;
      uint64_t CLR_3:1;
      uint64_t CLR_4:1;
      uint64_t CLR_5:1;
      uint64_t CLR_6:1;
      uint64_t reservedSpace2:3;
      uint64_t CLR_7:1;
      uint64_t reservedSpace3:2;
      uint64_t CLR_8:1;
      uint64_t CLR_9:1;
      uint64_t CLR_10:1;
      uint64_t reservedSpace4:5;
      uint64_t CLR_11:1;
      uint64_t CLR_12:1;
      uint64_t CLR_13:1;
      uint64_t CLR_14:1;
      uint64_t CLR_15:1;
      uint64_t CLR_16:1;
      uint64_t CLR_17:1;
      uint64_t CLR_18:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCICLEARINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_0:1;
      uint64_t SET_1:1;
      uint64_t reservedSpace0:2;
      uint64_t SET_2:1;
      uint64_t reservedSpace1:1;
      uint64_t SET_3:1;
      uint64_t SET_4:1;
      uint64_t SET_5:1;
      uint64_t SET_6:1;
      uint64_t reservedSpace2:3;
      uint64_t SET_7:1;
      uint64_t reservedSpace3:4;
      uint64_t SET_8:1;
      uint64_t reservedSpace4:5;
      uint64_t SET_9:1;
      uint64_t SET_10:1;
      uint64_t SET_11:1;
      uint64_t SET_12:1;
      uint64_t SET_13:1;
      uint64_t SET_14:1;
      uint64_t SET_15:1;
      uint64_t SET_16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCISETINTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_0:1;
      uint64_t CLR_1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_2:1;
      uint64_t reservedSpace1:1;
      uint64_t CLR_3:1;
      uint64_t CLR_4:1;
      uint64_t CLR_5:1;
      uint64_t CLR_6:1;
      uint64_t reservedSpace2:3;
      uint64_t CLR_7:1;
      uint64_t reservedSpace3:4;
      uint64_t CLR_8:1;
      uint64_t reservedSpace4:5;
      uint64_t CLR_9:1;
      uint64_t CLR_10:1;
      uint64_t CLR_11:1;
      uint64_t CLR_12:1;
      uint64_t CLR_13:1;
      uint64_t CLR_14:1;
      uint64_t CLR_15:1;
      uint64_t CLR_16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCICLEARINTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRKDT:1;
      uint64_t WAKEUP:1;
      uint64_t IDLE:1;
      uint64_t BUSY:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace0:1;
      uint64_t TOAWUS:1;
      uint64_t TOA3WUS:1;
      uint64_t TXRDY:1;
      uint64_t RXRDY:1;
      uint64_t TXWAKE:1;
      uint64_t TX:1;
      uint64_t RXWAKE:1;
      uint64_t ID_0:1;
      uint64_t ID_1:1;
      uint64_t reservedSpace1:9;
      uint64_t PE:1;
      uint64_t OE:1;
      uint64_t FE:1;
      uint64_t NRE:1;
      uint64_t ISFE:1;
      uint64_t CE:1;
      uint64_t PBE:1;
      uint64_t BE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIFLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT0:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVECT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT1:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVECT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHAR:3;
      uint64_t reservedSpace0:13;
      uint64_t LENGTH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIFORMAT;

