iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS30336/targetInit/tms570LS30336_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCITD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:1;
      uint64_t RX:1;
      uint64_t TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCIPIO8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBREAK:3;
      uint64_t reservedSpace0:5;
      uint64_t SDEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINCOMPARE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD3:8;
      uint64_t RD2:8;
      uint64_t RD1:8;
      uint64_t RD0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINRD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD7:8;
      uint64_t RD6:8;
      uint64_t RD5:8;
      uint64_t RD4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINRD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX:8;
      uint64_t reservedSpace0:8;
      uint64_t RX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:8;
      uint64_t ID_SlaveTask_BYTE:8;
      uint64_t Received_ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD3:8;
      uint64_t TD2:8;
      uint64_t TD1:8;
      uint64_t TD0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINTD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD7:8;
      uint64_t TD6:8;
      uint64_t TD5:8;
      uint64_t TD4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINTD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBR:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBRS;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPENA:1;
      uint64_t LPBENA:1;
      uint64_t reservedSpace0:6;
      uint64_t IODFTENA:4;
      uint64_t reservedSpace1:4;
      uint64_t TX:3;
      uint64_t PIN:2;
      uint64_t reservedSpace2:3;
      uint64_t BRKD:1;
      uint64_t PEN:1;
      uint64_t FEN:1;
      uint64_t reservedSpace3:1;
      uint64_t ISFE:1;
      uint64_t CEN:1;
      uint64_t PBEN:1;
      uint64_t BEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IODFTCTRL;

};

#define SCILIN_Serial_Communication_InterfaceLocal_Interconnect_Network_Module_SCILIN_1 (*(volatile struct SCILIN_Serial_Communication_InterfaceLocal_Interconnect_Network_Module_SCILIN_1_tag *) 0xfff7e500)

struct MibSPI_MibSPI1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIGCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTER:1;
      uint64_t CLKMOD:1;
      uint64_t reservedSpace0:6;
      uint64_t POWERDOWN:1;
      uint64_t reservedSpace1:7;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace2:7;
      uint64_t SPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIGCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLENERRENA:1;
      uint64_t TIMEOUTENA:1;
      uint64_t PARERRENA:1;
      uint64_t DESYNCENA:1;
      uint64_t BITERRENA:1;
      uint64_t reservedSpace0:1;
      uint64_t RXOVRNINTENA:1;
      uint64_t reservedSpace1:1;
      uint64_t RXINTENA:1;
      uint64_t TXINTENA:1;
      uint64_t reservedSpace2:6;
      uint64_t DMAREQEN:1;
      uint64_t reservedSpace3:7;
      uint64_t ENABLEHIGHZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIINT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLEN:1;
      uint64_t TIMEOUTLVL:1;
      uint64_t PARERRLVL:1;
      uint64_t DESYNCLVL:1;
      uint64_t BITERRLVL:1;
      uint64_t reservedSpace0:1;
      uint64_t RXOVRNINTLVL:1;
      uint64_t reservedSpace1:1;
      uint64_t RXINTLVL:1;
      uint64_t TXINTLVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPILVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLEN:1;
      uint64_t TIMEOUTFLG:1;
      uint64_t PARITYERRFLG:1;
      uint64_t DESYNCFLG:1;
      uint64_t BITERRFLG:1;
      uint64_t reservedSpace0:1;
      uint64_t RXOVRNINTFLG:1;
      uint64_t RXINTFLG:1;
      uint64_t TXINTFLG:1;
      uint64_t BUFINITACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSFUN:8;
      uint64_t ENAFUN:1;
      uint64_t CLKFUN:1;
      uint64_t SIMOFUN0:1;
      uint64_t SOMIFUN0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMOFUN:8;
      uint64_t SOMIFUN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDIR:8;
      uint64_t ENADIR:1;
      uint64_t CLKDIR:1;
      uint64_t SIMODIR0:1;
      uint64_t SOMIDIR0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMODIR:8;
      uint64_t SOMIDIR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDIN:8;
      uint64_t ENADIN:1;
      uint64_t CLKDIN:1;
      uint64_t SIMODIN0:1;
      uint64_t SOMIDIN0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMODIN:8;
      uint64_t SOMIDIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDOUT:8;
      uint64_t ENADOUT:1;
      uint64_t CLKDOUT:1;
      uint64_t SIMODOUT0:1;
      uint64_t SOMIDOUT0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMODOUT:8;
      uint64_t SOMIDOUT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSSET:8;
      uint64_t ENASET:1;
      uint64_t CLKSET:1;
      uint64_t SIMOSET0:1;
      uint64_t SOMISET0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMOSET:8;
      uint64_t SOMISET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSCLR:8;
      uint64_t ENACLR:1;
      uint64_t CLKCLR:1;
      uint64_t SIMOCLR0:1;
      uint64_t SOMICLR0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMOCLR:8;
      uint64_t SOMICLR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSPDR:8;
      uint64_t ENAPDR:1;
      uint64_t CLKPDR:1;
      uint64_t SIMOPDR0:1;
      uint64_t SOMIPDR0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMOPDR:8;
      uint64_t SOMIPDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSDIS:8;
      uint64_t ENADIS:1;
      uint64_t CLKDIS:1;
      uint64_t SIMODIS0:1;
      uint64_t SOMIDIS0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMODIS:8;
      uint64_t SOMIDIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCSPSEL:8;
      uint64_t ENAPSEL:1;
      uint64_t CLKPSEL:1;
      uint64_t SIMOPSEL0:1;
      uint64_t SOMIPSEL0:1;
      uint64_t reservedSpace0:4;
      uint64_t SIMOPSEL:8;
      uint64_t SOMIPSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPC8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t reservedSpace0:1;
      uint64_t CSHOLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLENERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIBUF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMU_RXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIEMU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C2EDELAY:8;
      uint64_t T2EDELAY:8;
      uint64_t T2CDELAY:8;
      uint64_t C2TDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDELAY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSDEF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIDEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t reservedSpace0:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DIS:1;
      uint64_t reservedSpace1:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t reservedSpace0:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DIS:1;
      uint64_t reservedSpace1:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t reservedSpace0:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DIS:1;
      uint64_t reservedSpace1:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHARLEN:5;
      uint64_t reservedSpace0:3;
      uint64_t PRESCALE:8;
      uint64_t PHASE:1;
      uint64_t POLARITY:1;
      uint64_t DIS:1;
      uint64_t reservedSpace1:1;
      uint64_t SHIFTDIR:1;
      uint64_t WAITENA:1;
      uint64_t PARITYENA:1;
      uint64_t PARPOL:1;
      uint64_t WDELAY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIFMT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPEND0:1;
      uint64_t INTVECT0:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVECT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPEND1:1;
      uint64_t INTVECT1:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTVECT1;

