iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS30336/targetInit/tms570LS30336_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Message_Number:8;
      uint64_t reservedSpace0:6;
      uint64_t DMAactive:1;
      uint64_t Busy:1;
      uint64_t Data_B:1;
      uint64_t Data_A:1;
      uint64_t TxRqstNewDat:1;
      uint64_t ClrIntPnd:1;
      uint64_t Control:1;
      uint64_t Arb:1;
      uint64_t Mask:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Msk:29;
      uint64_t reservedSpace0:1;
      uint64_t MDir:1;
      uint64_t MXtd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2MSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t Dir:1;
      uint64_t Xtd:1;
      uint64_t MsgVal:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:3;
      uint64_t reservedSpace0:4;
      uint64_t EoB:1;
      uint64_t TxRqst:1;
      uint64_t RmtEn:1;
      uint64_t RxIE:1;
      uint64_t TxIE:1;
      uint64_t UMask:1;
      uint64_t IntPnd:1;
      uint64_t MsgLst:1;
      uint64_t NewDat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_0:8;
      uint64_t Data_1:8;
      uint64_t Data_2:8;
      uint64_t Data_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_4:8;
      uint64_t Data_5:8;
      uint64_t Data_6:8;
      uint64_t Data_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2DATA_1;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Mask:1;
      uint64_t Arb:1;
      uint64_t Ctrl:1;
      uint64_t DataA:1;
      uint64_t DataB:1;
      uint64_t reservedSpace0:3;
      uint64_t IF3_0:1;
      uint64_t IF3_1:1;
      uint64_t IF3_2:1;
      uint64_t IF3_3:1;
      uint64_t IF3_4:1;
      uint64_t reservedSpace1:2;
      uint64_t IF3_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3OBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Msk:29;
      uint64_t reservedSpace0:1;
      uint64_t MDir:1;
      uint64_t MXtd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3MSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t Dir:1;
      uint64_t Xtd:1;
      uint64_t MsgVal:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:3;
      uint64_t reservedSpace0:4;
      uint64_t EoB:1;
      uint64_t TxRqst:1;
      uint64_t RmtEn:1;
      uint64_t RxIE:1;
      uint64_t TxIE:1;
      uint64_t UMask:1;
      uint64_t IntPnd:1;
      uint64_t MsgLst:1;
      uint64_t NewDat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_0:8;
      uint64_t Data_1:8;
      uint64_t Data_2:8;
      uint64_t Data_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_4:8;
      uint64_t Data_5:8;
      uint64_t Data_6:8;
      uint64_t Data_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3DATA_1;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD78;

  uint8_t res7[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t In:1;
      uint64_t Out:1;
      uint64_t Dir:1;
      uint64_t Func:1;
      uint64_t reservedSpace0:12;
      uint64_t OD:1;
      uint64_t PD:1;
      uint64_t PU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TIOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t In:1;
      uint64_t Out:1;
      uint64_t Dir:1;
      uint64_t Func:1;
      uint64_t reservedSpace0:12;
      uint64_t OD:1;
      uint64_t PD:1;
      uint64_t PU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_RIOC;

};

#define DCAN_DCAN2 (*(volatile struct DCAN_DCAN2_tag *) 0xfff7de00)

struct N2HET_N2HET1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TO:1;
      uint64_t reservedSpace0:15;
      uint64_t CMS:1;
      uint64_t IS:1;
      uint64_t PPF:1;
      uint64_t reservedSpace1:2;
      uint64_t MP:2;
      uint64_t reservedSpace2:1;
      uint64_t HET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETGCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRPFC:6;
      uint64_t reservedSpace0:2;
      uint64_t LRPFC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETPFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HETADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Offset1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Offset2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETOFF2;

  uint32_t HETINTENAS;
  uint32_t HETINTENAC;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Prgm_Ovrfl_Pry:1;
      uint64_t APCNT_0:1;
      uint64_t APCNT_1:1;
      uint64_t reservedSpace0:5;
      uint64_t Prgm_Ovrfl_Ena:1;
      uint64_t reservedSpace1:7;
      uint64_t APCNT_2:1;
      uint64_t reservedSpace2:7;
      uint64_t APCNT_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETEXC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Prgm_Ovrfl_Flag:1;
      uint64_t APCNT_0:1;
      uint64_t APCNT_1:1;
      uint64_t reservedSpace0:5;
      uint64_t Debug_Status_Flag:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETEXC2;

  uint32_t HETPRY;
  uint32_t HETFLG;
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETHRSH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETXOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQENA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETREQENS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQDIS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETREQENC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDS:8;
      uint64_t reservedSpace0:8;
      uint64_t TDBS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HETREQDS;

