iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS30336/targetInit/tms570LS30336_sfr.h
  uint8_t res1[11117300];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTURES:1;
      uint64_t reservedSpace0:7;
      uint64_t DEBM:1;
      uint64_t reservedSpace1:7;
      uint64_t HTUEN:1;
      uint64_t reservedSpace2:7;
      uint64_t VBUSHOLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_GC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_CPENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY1B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY1A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY0B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY0A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY3B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY3A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY2B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY2A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY5B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY5A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY4B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY4A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY7B:1;
      uint64_t reservedSpace0:7;
      uint64_t BUSY7A:1;
      uint64_t reservedSpace1:7;
      uint64_t BUSY6B:1;
      uint64_t reservedSpace2:7;
      uint64_t BUSY6A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BUSY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NACP:4;
      uint64_t reservedSpace0:4;
      uint64_t CETCOUNT:5;
      uint64_t reservedSpace1:1;
      uint64_t BUSBUSY:1;
      uint64_t TIPF:1;
      uint64_t ERRCPN:4;
      uint64_t reservedSpace2:4;
      uint64_t ERRETC:5;
      uint64_t reservedSpace3:2;
      uint64_t ERRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_ACPE;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLINTENA:1;
      uint64_t reservedSpace0:7;
      uint64_t CORL:1;
      uint64_t reservedSpace1:7;
      uint64_t BERINTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_RLBECTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFINTENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BFINTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFINTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BFINTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPINTMAP:16;
      uint64_t MAPSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_INTMAP;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOFF0:4;
      uint64_t reservedSpace0:4;
      uint64_t INTTYPE0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_INTOFF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOFF1:4;
      uint64_t reservedSpace0:4;
      uint64_t INTTYPE1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_INTOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BIM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRLFL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_RLOSTFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFINTFL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BFINTFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BERINTFL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_BERINTFL;

  uint32_t HTU_MP1S;
  uint32_t HTU_MP1E;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBREN:1;
      uint64_t reservedSpace0:15;
      uint64_t HTUDBGS:1;
      uint64_t reservedSpace1:7;
      uint64_t CPNUM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_DCTRL;

  uint32_t HTU_WPR;
  uint32_t HTU_WMR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:8;
      uint64_t TYPE:8;
      uint64_t CLASS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
      uint64_t reservedSpace1:7;
      uint64_t COPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_PCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAOFF:9;
      uint64_t reservedSpace0:7;
      uint64_t PEFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_PAR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG0ENA:1;
      uint64_t ACCR:1;
      uint64_t INTENA0:1;
      uint64_t REG01ENA:1;
      uint64_t ACCR01:1;
      uint64_t INTENA01:1;
      uint64_t reservedSpace0:2;
      uint64_t CPNUM1:4;
      uint64_t reservedSpace1:4;
      uint64_t MPEFT0:1;
      uint64_t MPEFT1:1;
      uint64_t reservedSpace2:6;
      uint64_t CPNUM0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_MPCS;

  uint32_t HTU_MP0S;
  uint32_t HTU_MP0E;
};

#define HTU (*(volatile struct HTU_tag *) 0xff4e0000)

struct DMA_tag
{
  uint32_t ISADDR;
  uint32_t IDADDR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IETCOUNT:13;
      uint64_t reservedSpace0:3;
      uint64_t IFTCOUNT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITCOUNT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AIM:1;
      uint64_t ADDMW:2;
      uint64_t ADDMR:2;
      uint64_t reservedSpace0:3;
      uint64_t TTYPE:1;
      uint64_t reservedSpace1:3;
      uint64_t WES:2;
      uint64_t RES:2;
      uint64_t CHAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDXS:13;
      uint64_t reservedSpace0:3;
      uint64_t EIDXD:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIOFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIDXS:13;
      uint64_t reservedSpace0:3;
      uint64_t FIDXD:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIOFF;

