iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS30336/targetInit/tms570LS30336_sfr.h
};

#define VIM (*(volatile struct VIM_tag *) 0xfffffdec)

struct ESM_tag
{
  uint32_t ESMEEPAPR1;
  uint32_t ESMDEPAPR1;
  uint32_t ESMIESR1;
  uint32_t ESMIECR1;
  uint32_t ESMILSR1;
  uint32_t ESMILCR1;
  uint32_t ESMSR1;
  uint32_t ESMSR2;
  uint32_t ESMSR3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMEPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTOFFH:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIOFFHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTOFFL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMIOFFLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMLTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTCP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMLTCPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EKEY:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESMEKR;

  uint32_t ESMSSR2;
  uint32_t ESMIEPSR4;
  uint32_t ESMIEPCR4;
  uint32_t ESMIESR4;
  uint32_t ESMIECR4;
  uint32_t ESMILSR4;
  uint32_t ESMILCR4;
  uint32_t ESMSR4;
};

#define ESM (*(volatile struct ESM_tag *) 0xfffff500)

struct DMM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ONOFF:4;
      uint64_t reservedSpace0:4;
      uint64_t TM_DMM:1;
      uint64_t DDM_WIDTH:2;
      uint64_t reservedSpace1:5;
      uint64_t RESET:1;
      uint64_t COS:1;
      uint64_t CONTCLK:1;
      uint64_t reservedSpace2:5;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMGLBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERR:1;
      uint64_t DEST1_ERR:1;
      uint64_t DEST2_ERR:1;
      uint64_t DEST3_ERR:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMINTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERR:1;
      uint64_t DEST1_ERR:1;
      uint64_t DEST2_ERR:1;
      uint64_t DEST3_ERR:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMINTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERR:1;
      uint64_t DEST1_ERR:1;
      uint64_t DEST2_ERR:1;
      uint64_t DEST3_ERR:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMINTLVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACKET_ERR_INT:1;
      uint64_t DEST0_ERR:1;
      uint64_t DEST1_ERR:1;
      uint64_t DEST2_ERR:1;
      uint64_t DEST3_ERR:1;
      uint64_t SRC_OVF:1;
      uint64_t BUFF_OVF:1;
      uint64_t BUSERROR:1;
      uint64_t DEST0REG1:1;
      uint64_t DEST0REG2:1;
      uint64_t DEST1REG1:1;
      uint64_t DEST1REG2:1;
      uint64_t DEST2REG1:1;
      uint64_t DEST2REG2:1;
      uint64_t DEST3REG1:1;
      uint64_t DEST3REG2:1;
      uint64_t EO_BUFF:1;
      uint64_t PROG_BUFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMINTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMOFF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMOFF2;

  uint32_t DMMDDMDEST;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDDMBL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POINTER:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDDMPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPT:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMINTPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST0REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST0BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST0REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST0BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST1REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST1BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST1REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST1BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST2REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST2BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST2REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST2BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST3REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST3BL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKADDR:18;
      uint64_t BASEADDR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST3REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCKSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMDEST3BL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCFUNC:1;
      uint64_t CLKFUNC:1;
      uint64_t DATAFUNC:16;
      uint64_t ENAFUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCDIR:1;
      uint64_t CLKDIR:1;
      uint64_t DATADIR:16;
      uint64_t ENADIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCIN:1;
      uint64_t CLKIN:1;
      uint64_t DATAIN:16;
      uint64_t ENAIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCOUT:1;
      uint64_t CLKOUT:1;
      uint64_t DATAOUT:16;
      uint64_t ENAOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCSET:1;
      uint64_t CLKSET:1;
      uint64_t DATASET:16;
      uint64_t ENASET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCCLR:1;
      uint64_t CLKCLR:1;
      uint64_t DATACLR:16;
      uint64_t ENACLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPDR:1;
      uint64_t CLKPDR:1;
      uint64_t DATAPDR:16;
      uint64_t ENAPDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCDIS:1;
      uint64_t CLKDIS:1;
      uint64_t DATADIS:16;
      uint64_t ENADIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCPSEL:1;
      uint64_t CLKPSEL:1;
      uint64_t DATAPSEL:16;
      uint64_t ENAPSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMMPC8;

